RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV31F51212/include/MKV31F51212.h
/* FMC - Register instance definitions */
/* FMC */
#define FMC_PFAPR                                FMC_PFAPR_REG(FMC)
#define FMC_PFB0CR                               FMC_PFB0CR_REG(FMC)
#define FMC_PFB1CR                               FMC_PFB1CR_REG(FMC)
#define FMC_TAGVDW0S0                            FMC_TAGVDW0S_REG(FMC,0)
#define FMC_TAGVDW0S1                            FMC_TAGVDW0S_REG(FMC,1)
#define FMC_TAGVDW0S2                            FMC_TAGVDW0S_REG(FMC,2)
#define FMC_TAGVDW0S3                            FMC_TAGVDW0S_REG(FMC,3)
#define FMC_TAGVDW0S4                            FMC_TAGVDW0S_REG(FMC,4)
#define FMC_TAGVDW0S5                            FMC_TAGVDW0S_REG(FMC,5)
#define FMC_TAGVDW0S6                            FMC_TAGVDW0S_REG(FMC,6)
#define FMC_TAGVDW0S7                            FMC_TAGVDW0S_REG(FMC,7)
#define FMC_TAGVDW1S0                            FMC_TAGVDW1S_REG(FMC,0)
#define FMC_TAGVDW1S1                            FMC_TAGVDW1S_REG(FMC,1)
#define FMC_TAGVDW1S2                            FMC_TAGVDW1S_REG(FMC,2)
#define FMC_TAGVDW1S3                            FMC_TAGVDW1S_REG(FMC,3)
#define FMC_TAGVDW1S4                            FMC_TAGVDW1S_REG(FMC,4)
#define FMC_TAGVDW1S5                            FMC_TAGVDW1S_REG(FMC,5)
#define FMC_TAGVDW1S6                            FMC_TAGVDW1S_REG(FMC,6)
#define FMC_TAGVDW1S7                            FMC_TAGVDW1S_REG(FMC,7)
#define FMC_TAGVDW2S0                            FMC_TAGVDW2S_REG(FMC,0)
#define FMC_TAGVDW2S1                            FMC_TAGVDW2S_REG(FMC,1)
#define FMC_TAGVDW2S2                            FMC_TAGVDW2S_REG(FMC,2)
#define FMC_TAGVDW2S3                            FMC_TAGVDW2S_REG(FMC,3)
#define FMC_TAGVDW2S4                            FMC_TAGVDW2S_REG(FMC,4)
#define FMC_TAGVDW2S5                            FMC_TAGVDW2S_REG(FMC,5)
#define FMC_TAGVDW2S6                            FMC_TAGVDW2S_REG(FMC,6)
#define FMC_TAGVDW2S7                            FMC_TAGVDW2S_REG(FMC,7)
#define FMC_TAGVDW3S0                            FMC_TAGVDW3S_REG(FMC,0)
#define FMC_TAGVDW3S1                            FMC_TAGVDW3S_REG(FMC,1)
#define FMC_TAGVDW3S2                            FMC_TAGVDW3S_REG(FMC,2)
#define FMC_TAGVDW3S3                            FMC_TAGVDW3S_REG(FMC,3)
#define FMC_TAGVDW3S4                            FMC_TAGVDW3S_REG(FMC,4)
#define FMC_TAGVDW3S5                            FMC_TAGVDW3S_REG(FMC,5)
#define FMC_TAGVDW3S6                            FMC_TAGVDW3S_REG(FMC,6)
#define FMC_TAGVDW3S7                            FMC_TAGVDW3S_REG(FMC,7)
#define FMC_DATAW0S0U                            FMC_DATA_U_REG(FMC,0,0)
#define FMC_DATAW0S0L                            FMC_DATA_L_REG(FMC,0,0)
#define FMC_DATAW0S1U                            FMC_DATA_U_REG(FMC,0,1)
#define FMC_DATAW0S1L                            FMC_DATA_L_REG(FMC,0,1)
#define FMC_DATAW0S2U                            FMC_DATA_U_REG(FMC,0,2)
#define FMC_DATAW0S2L                            FMC_DATA_L_REG(FMC,0,2)
#define FMC_DATAW0S3U                            FMC_DATA_U_REG(FMC,0,3)
#define FMC_DATAW0S3L                            FMC_DATA_L_REG(FMC,0,3)
#define FMC_DATAW0S4U                            FMC_DATA_U_REG(FMC,0,4)
#define FMC_DATAW0S4L                            FMC_DATA_L_REG(FMC,0,4)
#define FMC_DATAW0S5U                            FMC_DATA_U_REG(FMC,0,5)
#define FMC_DATAW0S5L                            FMC_DATA_L_REG(FMC,0,5)
#define FMC_DATAW0S6U                            FMC_DATA_U_REG(FMC,0,6)
#define FMC_DATAW0S6L                            FMC_DATA_L_REG(FMC,0,6)
#define FMC_DATAW0S7U                            FMC_DATA_U_REG(FMC,0,7)
#define FMC_DATAW0S7L                            FMC_DATA_L_REG(FMC,0,7)
#define FMC_DATAW1S0U                            FMC_DATA_U_REG(FMC,1,0)
#define FMC_DATAW1S0L                            FMC_DATA_L_REG(FMC,1,0)
#define FMC_DATAW1S1U                            FMC_DATA_U_REG(FMC,1,1)
#define FMC_DATAW1S1L                            FMC_DATA_L_REG(FMC,1,1)
#define FMC_DATAW1S2U                            FMC_DATA_U_REG(FMC,1,2)
#define FMC_DATAW1S2L                            FMC_DATA_L_REG(FMC,1,2)
#define FMC_DATAW1S3U                            FMC_DATA_U_REG(FMC,1,3)
#define FMC_DATAW1S3L                            FMC_DATA_L_REG(FMC,1,3)
#define FMC_DATAW1S4U                            FMC_DATA_U_REG(FMC,1,4)
#define FMC_DATAW1S4L                            FMC_DATA_L_REG(FMC,1,4)
#define FMC_DATAW1S5U                            FMC_DATA_U_REG(FMC,1,5)
#define FMC_DATAW1S5L                            FMC_DATA_L_REG(FMC,1,5)
#define FMC_DATAW1S6U                            FMC_DATA_U_REG(FMC,1,6)
#define FMC_DATAW1S6L                            FMC_DATA_L_REG(FMC,1,6)
#define FMC_DATAW1S7U                            FMC_DATA_U_REG(FMC,1,7)
#define FMC_DATAW1S7L                            FMC_DATA_L_REG(FMC,1,7)
#define FMC_DATAW2S0U                            FMC_DATA_U_REG(FMC,2,0)
#define FMC_DATAW2S0L                            FMC_DATA_L_REG(FMC,2,0)
#define FMC_DATAW2S1U                            FMC_DATA_U_REG(FMC,2,1)
#define FMC_DATAW2S1L                            FMC_DATA_L_REG(FMC,2,1)
#define FMC_DATAW2S2U                            FMC_DATA_U_REG(FMC,2,2)
#define FMC_DATAW2S2L                            FMC_DATA_L_REG(FMC,2,2)
#define FMC_DATAW2S3U                            FMC_DATA_U_REG(FMC,2,3)
#define FMC_DATAW2S3L                            FMC_DATA_L_REG(FMC,2,3)
#define FMC_DATAW2S4U                            FMC_DATA_U_REG(FMC,2,4)
#define FMC_DATAW2S4L                            FMC_DATA_L_REG(FMC,2,4)
#define FMC_DATAW2S5U                            FMC_DATA_U_REG(FMC,2,5)
#define FMC_DATAW2S5L                            FMC_DATA_L_REG(FMC,2,5)
#define FMC_DATAW2S6U                            FMC_DATA_U_REG(FMC,2,6)
#define FMC_DATAW2S6L                            FMC_DATA_L_REG(FMC,2,6)
#define FMC_DATAW2S7U                            FMC_DATA_U_REG(FMC,2,7)
#define FMC_DATAW2S7L                            FMC_DATA_L_REG(FMC,2,7)
#define FMC_DATAW3S0U                            FMC_DATA_U_REG(FMC,3,0)
#define FMC_DATAW3S0L                            FMC_DATA_L_REG(FMC,3,0)
#define FMC_DATAW3S1U                            FMC_DATA_U_REG(FMC,3,1)
#define FMC_DATAW3S1L                            FMC_DATA_L_REG(FMC,3,1)
#define FMC_DATAW3S2U                            FMC_DATA_U_REG(FMC,3,2)
#define FMC_DATAW3S2L                            FMC_DATA_L_REG(FMC,3,2)
#define FMC_DATAW3S3U                            FMC_DATA_U_REG(FMC,3,3)
#define FMC_DATAW3S3L                            FMC_DATA_L_REG(FMC,3,3)
#define FMC_DATAW3S4U                            FMC_DATA_U_REG(FMC,3,4)
#define FMC_DATAW3S4L                            FMC_DATA_L_REG(FMC,3,4)
#define FMC_DATAW3S5U                            FMC_DATA_U_REG(FMC,3,5)
#define FMC_DATAW3S5L                            FMC_DATA_L_REG(FMC,3,5)
#define FMC_DATAW3S6U                            FMC_DATA_U_REG(FMC,3,6)
#define FMC_DATAW3S6L                            FMC_DATA_L_REG(FMC,3,6)
#define FMC_DATAW3S7U                            FMC_DATA_U_REG(FMC,3,7)
#define FMC_DATAW3S7L                            FMC_DATA_L_REG(FMC,3,7)

